
'''2 уровень задача 2
Дана матрица А размером 7 × 5. Если количество положитель- ных элементов столбца больше количества отрицательных, то мак- симальный элемент этого столбца заменить на 0, в противном случае максимальный элемент заменить на номер максимального элемента
этого столбца .'''

def f(x):
    s = []
    for i in range(5):
        a = []
        for j in range(7):
            a += [x[j][i]]
        s += [a]
    for i in range(5):
        cnt = 0
        a = s[i]
        am = max(a)
        al = a.index(am)
        for x in a:
            if x > 0: cnt += 1
            if cnt > 2: a[al] = 0
            else: a[al] = al + 1

    arr = []
    for i in range(7):
        a = []
        for j in range(5):
            a += [s[j][i]]
        arr += [a]
    return arr



if f([[-136, -415, 3, -153, 365], [33, 349, -40, -807, -211], [939, 716, 802, 0, -159], [1, 222, -804, 0, -994], [1, -990, -413, -548, -789], [1, 222, -804, 0, -994], [1, -990, -413, -548, -789]]) == \
[[-136, -415, 3, -153, 1], [33, 349, -40, -807, -211], [0, 0, 3, 3, -159], [1, 222, -804, 0, -994], [1, -990, -413, -548, -789], [1, 222, -804, 0, -994], [1, -990, -413, -548, -789]]:\
    print('проверка пройдена')
from random import *
matrix = [[randint(-10, 10) for _ in range(5)] for _ in range(7)]
print(*matrix)
print(*f(matrix))

